app/controllers/reagents_controller.rb

SELECT "reagents".* FROM "reagents"
---
  def index
    @reagents = Reagent.all

SELECT  "reagents".* FROM "reagents" WHERE "reagents"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @reagent = Reagent.find(params[:id])

INSERT INTO "reagents" ("name", "maker", "number", "amount", "price", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["name", "フェノールフタレイン"], ["maker", "理研"], ["number", 123], ["amount", "111"], ["price", 1234000], ["created_at", "2019-06-05 15:27:59.042390"], ["updated_at", "2019-06-05 15:27:59.042390"]]
---
  def create
    @reagent = Reagent.new(reagent_params)
    if @reagent.save