app/controllers/reagents_controller.rb

SELECT  "reagents".* FROM "reagents" ORDER BY "reagents"."id" ASC LIMIT ?  [["LIMIT", 1]]
---
  def show
    @reagent = Reagent.first